/************************************************************************************
*  Copyright (c), 2004-2022, 北京中嵌凌云电子有限公司
*            All rights reserved.
*
* http:  www.embedarm.com
* Email: embedarm@126.com
*
* File name: AMKN8639_IOConfig.h
* Project  : STM/GD32F1XX/3XX/4XX/H7XX系列模块软件
* Processor: STM/GD32F1XX/3XX/4XX/H7XX
* Compiler : RealView MDK-ARM Compiler
* 
* Author:  EmbedARM
* Email:   EmbedARM@126.com
* 
* Description: 本文件是AMKN8639工控板IO端口功能, 客户可根据模块实际应用进行更改;
*
* Others: none;
*
* Function List:
*		
* Modifiy History:
*   1. Version: 1.10
*      Date:    2021.9.1
*      Modifiy: none
*
*************************************************************************************/
#ifndef __AMKN8639_IOCONFIG_H 
#define __AMKN8639_IOCONFIG_H 

/************************************************************************************/
// 端口定义说明
/************************************************************************************/
/*
|-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| 产品型号 | 端口标号、类型及说明         |  1脚  |  2脚  |  3脚  |  4脚  |  5脚  |  6脚  |  7脚   |  8脚   |   9脚   |   10脚   |  11脚  |  12脚  |     备注                                     |
|-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
|          | JP6: DI1-DI8, 光电隔离输入   |  COM  |  DI1  |  DI2  |  DI3  |  DI4  |  DI5  |  DI6   |  DI7   |   DI8   |    -     | 由MCU IO口直接驱动                                             |
|          |--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
|          | JP5: DO1-DO8, 光电隔离输出   |  +OPT |  DO1  |  DO2  |  DO3  |  DO4  |  DO5  |  DO6   |  DO7   |   DO8   |    GND   | 由MCU IO口直接驱动                                             |
|          |--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
|          | JP7: 继电器控制输出          |K1/DO9 |K2/DO10| COM12 |K3/DO11|K4/DO12|  COMA |                                      | 继电器K1~K4分别由DO9~DO16控制输出                              | 
|          |--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| AMKN8639 | JP18: 继电器控制输出         |K5/DO13|K6/DO14| COM56 |K7/DO15|K8/DO16|  COMB |                                      | 继电器K5~K8分别由DO9~DO16控制输出                              | 
|          |--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
|          | JP20: 1路RS232接口           |  TX3  |  RX3  |  GMD  |   -   |   -   |   -   |    -   |    -   |    -    |    -     | TX3: RS232发送端口;RX3表示: RS232接收端口                      |
|          |                              | UART3转RS232  |  地   |   -   |   -   |   -   |    -   |    -   |    -    |    -     |                                                                |
|          |--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
|          | JP9:  1路(LCD)RS232接口      |  VDD  |  TX4  |  RX4  |  GND  |   -   |   -   |    -   |    -   |    -    |    -     | TX4: RS232发送端口;RX4表示: RS232接收端口, 用于接串口LCD       |
|          |                              |       | UART4转RS232  |  地   |   -   |   -   |    -   |    -   |    -    |    -     | VDD: 电源(24V)正极输出                                         |
|          |--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
|          | JP7: 3路RS485接口,数字隔离   |  A1+  |  B1-  |  A2+  |  B2-  |  A3+  |  B3-  |    -   |    -   |    -    |    -     | RK10:是A1+/B1-终端电阻短接点; RK11:是A2+/B2-终端电阻短接点;    |
|          |                              | UART6转RS485  | UART7转RS485  | UART8转RS485  |    -   |    -   |    -    |    -     | RK13:是A3+/B3-终端电阻短接点;                                  |
|          |--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
|          | JP19: 2路FDCAN接口,数字隔离  | CAN1H | CAN1L | CAN2H | CAN2L |   -   |   -   |   -    |   -    |    -    |    -     | CAN1: RK9,短接,启用120电阻; CAN2: RK12,短接,启用120电阻;       |
|          |--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
|          | JP14: 3路差分脉冲输入        |  +VT  |  FA+  |  FA-  |  FB+  |  FB-  |  FZ+  |  FZ-   |  GND   |    -    | FA+/FA-:FCLK1CH1(PI5); FB+/FB-:FCLK1CH2(PI6); FZ+/FZ-:FCLK1CH3(PI7)       |
|          |--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
|          | JP8: 1路PWM输出接口,差分输出 | PUL1+ | PUL1- | DIR1+ | DIR1- |  +5V  | ENA1- |   -    |   -    |    -    |    -     |                                                                |
|          |                              |      PWM1     |      DIR1     |      ENA1     |   -    |   -    |    -    |    -     |PWM1:PWM1_PUL(PA8);DIR1:PWM1_DIR(PJ13);ENA1:PWM1_ENA(PJ14)      |
|          |--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
|          | JP12:1路PWM输出接口,差分输出 | PUL2+ | PUL2- | DIR2+ | DIR2- |  +5V  | ENA2- |   -    |   -    |    -    |    -     |                                                                |
|          |                              |      PWM2     |      DIR2     |      ENA2     |   -    |   -    |    -    |    -     |PWM2:PWM2_PUL(PA15);DIR2:PWM2_DIR(PD3);ENA2:PWM2_ENA(PD4)       |
|          |--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
|          | JP13:1路PWM输出接口,差分输出 | PUL3+ | PUL3- | DIR3+ | DIR3- |  +5V  | ENA3- |   -    |   -    |    -    |    -     |                                                                |
|          |                              |      PWM3     |      DIR3     |      ENA3     |   -    |   -    |    -    |    -     |PWM3:PWM3_PUL(PC6);DIR3:PWM3_DIR(PC7);ENA3:PWM3_ENA(PH15)       |
|          |--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
|          | JP4:1路PWM输出接口,差分输出  | PUL4+ | PUL4- | DIR4+ | DIR4- |  +5V  | ENA4- |   -    |   -    |    -    |    -     |                                                                |
|          |                              |      PWM4     |      DIR4     |      ENA4     |   -    |   -    |    -    |    -     |PWM4:PWM4_PUL(PF7);DIR4:PWM4_DIR(PJ0);ENA4:PWM4_ENA(PJ1)        |
|          |--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
|          | JP11:2路DAC输出接口,0-10V输出|  AO1  |  AO2  |  GND  |   -   |   -   |   -   |   -    |   -    |    -    |    -     |DAC1/2就是AO1/2,GND:模拟地;									  |
|          |--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
|          | JP1: 4路AI输入接口           |  12V  |  AI1  |  AI2  |  AI3  |  AI4  |  AGND |   -    |   -    |    -    |    -     | 12V:电源正极输出; RK1~4断开:AI1~4,0-10V输入;RK1~4短接:AI1~4,0-20mA输入|
|          |--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
|          | JP3: 4路AI输入接口           |  12V  |  AI5  |  AI6  |  AI7  |  AI8  |  AGND |   -    |   -    |    -    |    -     | 12V:电源正极输出; RK5~8断开:AI5~8,0-10V输入;RK5~8短接:AI5~8,0-20mA输入|
|          |--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
|          | JP2: 电源输入和输出接口      |  VDD  |  GND  |  +12V |  +5V  |  GND  |  -    |    -    |  -    |    -    |    -     | VDD为输入电压: 24V; +12V/+5V为输出电压端口                     |
|          |--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
|          | JP22: USB主机接口            | -                                                                                    | 可以插入U盘                                                |
|          |--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
|          | JP3？？: 100M以太网口            | -                                                                                | 只支持100M网络                                                 |
|          |--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
|          | USB1: USB转UART调试接口      | 内部连接UART1                                                                        | 只用于DEBUG调试输出和更新固件                                              |
|-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
*/
/************************************************************************************/
// 引用外部头文件
/************************************************************************************/
#include "config.h"	 

/************************************************************************************/
// DO输出端口定义
/************************************************************************************/
#define DO_NUM        16     // 定义DO输出端口数量 

// JP5 DO1-DO8定义:     JP5->1脚(+OPT) 
#define DO1   PH6    // JP5->2脚
#define DO2   PH7    // JP5->3脚
#define DO3   PG7    // JP5->4脚
#define DO4   PJ12   // JP5->5脚
#define DO5   PI0    // JP5->6脚
#define DO6   PI2    // JP5->7脚
#define DO7   PI1    // JP5->8脚
#define DO8   PI3    // JP5->9脚
					 // JP5->10脚(GND)

// JP7 继电器K1(DO9)-K4(DO12)定义: 
					  // JP7->1脚, 继电器K1-K4公共端COMA
#define DO9    PB7    // JP7->2脚, 继电器K1
#define DO10   PI4    // JP7->3脚, 继电器K2
#define DO11   PE2    // JP7->4脚, 继电器K3
#define DO12   PE6    // JP7->5脚, 继电器K4

// JP18 继电器K5(DO13)-K8(DO16)定义: 
				      // JP18->1脚, 继电器K5-K8公共端COMB
#define DO13   PE4    // JP18->2脚, 继电器K5
#define DO14   PE5    // JP18->3脚, 继电器K6
#define DO15   PE3    // JP18->4脚, 继电器K7
#define DO16   PI9    // JP18->5脚, 继电器K8


// 定义DO输出速度
#define IO_SPEED  IO_SPEED_10MHz   // IO_SPEED_2MHz, IO_SPEED_10MHz, IO_SPEED_50MHz, IO_SPEED_100MHz

// 定义DO输出模式
#define DO_OUT_MODE   IO_OUT_PP    // 定义DO输出端口模式: IO_OUT_PP为推挽输出模式; IO_OUT_OD为开路输出模式

#if (DO_OUT_MODE == IO_OUT_PP)
#define DO1_INIT_VAL  0 // 定义DO1输出初始化值
#define DO2_INIT_VAL  0 // 定义DO2输出初始化值
#define DO3_INIT_VAL  0 // 定义DO3输出初始化值
#define DO4_INIT_VAL  0 // 定义DO4输出初始化值
#define DO5_INIT_VAL  0 // 定义DO5输出初始化值
#define DO6_INIT_VAL  0 // 定义DO6输出初始化值
#define DO7_INIT_VAL  0 // 定义DO7输出初始化值
#define DO8_INIT_VAL  0 // 定义DO8输出初始化值

#define DO9_INIT_VAL  0 // 定义DO9输出初始化值
#define DO10_INIT_VAL 0 // 定义DO10输出初始化值
#define DO11_INIT_VAL 0 // 定义DO11输出初始化值
#define DO12_INIT_VAL 0 // 定义DO12输出初始化值
#define DO13_INIT_VAL 0 // 定义DO13输出初始化值
#define DO14_INIT_VAL 0 // 定义DO14输出初始化值
#define DO15_INIT_VAL 0 // 定义DO15输出初始化值
#define DO16_INIT_VAL 0 // 定义DO16输出初始化值
#else
#define DO1_INIT_VAL  1 // 定义DO1输出初始化值
#define DO2_INIT_VAL  1 // 定义DO2输出初始化值
#define DO3_INIT_VAL  1 // 定义DO3输出初始化值
#define DO4_INIT_VAL  1 // 定义DO4输出初始化值
#define DO5_INIT_VAL  1 // 定义DO5输出初始化值
#define DO6_INIT_VAL  1 // 定义DO6输出初始化值
#define DO7_INIT_VAL  1 // 定义DO7输出初始化值
#define DO8_INIT_VAL  1 // 定义DO8输出初始化值

#define DO9_INIT_VAL  1 // 定义DO9输出初始化值
#define DO10_INIT_VAL 1 // 定义DO10输出初始化值
#define DO11_INIT_VAL 1 // 定义DO11输出初始化值
#define DO12_INIT_VAL 1 // 定义DO12输出初始化值
#define DO13_INIT_VAL 1 // 定义DO13输出初始化值
#define DO14_INIT_VAL 1 // 定义DO14输出初始化值
#define DO15_INIT_VAL 1 // 定义DO15输出初始化值
#define DO16_INIT_VAL 1 // 定义DO16输出初始化值

#endif

/************************************************************************************/
// DI输出端口定义
/************************************************************************************/
#define DI_NUM   8      // 定义DI输入数量 

// JP6 DI1-DI8定义:     JP6->1脚(COM) 
#define DI1   PD11    // JP6->2脚, 可以产生中断, 参考EXTI0~EXTI19 输入中断配置
#define DI2   PD12    // JP6->3脚, 可以产生中断, 参考EXTI0~EXTI19 输入中断配置
#define DI3   PD13    // JP6->4脚, 可以产生中断, 参考EXTI0~EXTI19 输入中断配置
#define DI4   PH11    // JP6->5脚, 可以产生中断, 参考EXTI0~EXTI19 输入中断配置
#define DI5   PH12    // JP6->6脚, 可以产生中断, 参考EXTI0~EXTI19 输入中断配置
#define DI6   PH10    // JP6->7脚, 可以产生中断, 参考EXTI0~EXTI19 输入中断配置
#define DI7   PH9     // JP6->8脚, 可以产生中断, 参考EXTI0~EXTI19 输入中断配置
#define DI8   PH8     // JP6->9脚, 可以产生中断, 参考EXTI0~EXTI19 输入中断配置

/************************************************************************************/
// LED/蜂鸣器
/************************************************************************************/
#define ALED_NUM    2     // ALARM+LED总数量    

// 蜂鸣器IO定义
#define ALARM       PG3

// LED IO定义
#define LED1        PI8
#define LED2        IO_NONE

// 运行LED定义
#define RUN_LED     LED1

/************************************************************************************/
// AI端口定义
/************************************************************************************/
#define  AI_NUM      8      // 定义AI输入端口数量 

// 设置板子端口模拟量输入AI1-AI8与模块模拟量AIN0-AIN20对应关系
// JP1定义       模块管脚定义
#define  AI1        AIN12    // 设置AI1<->AIN12(PC2) 
#define  AI2        AIN13    // 设置AI2<->AIN13(PC3)
#define  AI3        AIN16    // 设置AI3<->AIN16(PA0)
#define  AI4        AIN0     // 设置AI4<->AIN0(PA0_C)  
// JP3定义       模块管脚定义
#define  AI5        AIN1     // 设置AI5<->AIN1(PA1_C)
#define  AI6        AIN15    // 设置AI6<->AIN15(PA3)
#define  AI7        AIN5     // 设置AI7<->AIN5(PB1)
#define  AI8        AIN9     // 设置AI8<->AIN9(PB0)

/************************************************************************************/
// UART(RS232/RS485)端口定义
/************************************************************************************/
// UART1(管脚)功能重映射设置: 转成TTL(USB1)
#define UART1_TX         PA9             // 设置TX管脚, 对应JP20的1脚TX1
#define UART1_RX         PA10             // 设置RX管脚, 对应JP20的2脚RX1  
#define UART1_DIR        IO_NONE         // 设置RS485方向控制IO, 没有转RS485接口则设置为IO_NONE
#define UART1_DIR_HL     0               // 定义RS485通信时接收数据时方向电平, 0: 低电平接收; 1: 高电平接收

// UART2(管脚)功能重映射设置: TTL接口(接WIFI模块)
#define UART2_TX         PD5             // 设置TX管脚
#define UART2_RX         PD6             // 设置RX管脚
#define UART2_DIR        IO_NONE         // 设置RS485方向控制IO, 没有转RS485接口则设置为IO_NONE
#define UART2_DIR_HL     0               // 定义RS485通信时接收数据时方向电平, 0: 低电平接收; 1: 高电平接收

// UART3(管脚)功能重映射设置: 转成RS232接口(JP20的TX3、RX3)
#define UART3_TX         PB10             // 设置TX管脚
#define UART3_RX         PB11             // 设置RX管脚 
#define UART3_DIR        IO_NONE          // 设置RS485方向控制IO, 没有转RS485接口则设置为IO_NONE
#define UART3_DIR_HL     0                // 定义RS485通信时接收数据时方向电平, 0: 低电平接收; 1: 高电平接收

// UART4(管脚)功能重映射设置: 转成RS232接口(JP9的TX4、RX4)
#define UART4_TX         PA12             // 设置TX管脚
#define UART4_RX         PA11             // 设置RX管脚
#define UART4_DIR        IO_NONE          // 设置RS485方向控制IO, 没有转RS485接口则设置为IO_NONE
#define UART4_DIR_HL     0                // 定义RS485通信时接收数据时方向电平, 0: 低电平接收; 1: 高电平接收

/*
// UART5(管脚)功能重映射设置: 转成RS232接口(JP20的TX5、RX5)
#define UART5_TX         PC12             // 设置TX管脚, 对应JP20的3脚TX5
#define UART5_RX         PD2              // 设置RX管脚, 对应JP20的4脚RX5
#define UART5_DIR        IO_NONE          // 设置RS485方向控制IO, 没有转RS485接口则设置为IO_NONE
#define UART5_DIR_HL     0                // 定义RS485通信时接收数据时方向电平, 0: 低电平接收; 1: 高电平接收
*/

// UART6(管脚)功能重映射设置: 转成RS485接口(JP7的A1+、B1-)
#define UART6_TX         PG14             // 设置TX管脚
#define UART6_RX         PG9              // 设置RX管脚 
#define UART6_DIR        PD7              // 设置RS485方向控制IO, 没有转RS485接口则设置为IO_NONE
#define UART6_DIR_HL     0                // 定义RS485通信时接收数据时方向电平, 0: 低电平接收; 1: 高电平接收

// UART7(管脚)功能重映射设置: 转成RS485接口(JP7的A2+、B2-)
#define UART7_TX         PB4              // 设置TX管脚
#define UART7_RX         PB3              // 设置RX管脚 
#define UART7_DIR        PG10             // 设置RS485方向控制IO, 没有转RS485接口则设置为IO_NONE
#define UART7_DIR_HL     0                // 定义RS485通信时接收数据时方向电平, 0: 低电平接收; 1: 高电平接收

// UART8(管脚)功能重映射设置: 转成RS485接口(JP8的A3+、B3-)
#define UART8_TX         PJ8             // 设置TX管脚
#define UART8_RX         PJ9             // 设置RX管脚 
#define UART8_DIR        PJ7             // 设置RS485方向控制IO, 没有转RS485接口则设置为IO_NONE
#define UART8_DIR_HL     0               // 定义RS485通信时接收数据时方向电平, 0: 低电平接收; 1: 高电平接收


/************************************************************************************/
// CAN端口定义
/************************************************************************************/
// CAN1(管脚)功能重映射设置: JP19的CAN1H、CAN1L
#define CAN1_TX         PH13            // CAN1设置TX管脚
#define CAN1_RX         PH14            // CAN1设置RX管脚

// CAN2(管脚)功能重映射设置: JP19的CAN2H、CAN2L
#define CAN2_TX         PB6            // CAN2设置TX管脚
#define CAN2_RX         PB5            // CAN2设置RX管脚

/************************************************************************************/
// PWM端口定义
/************************************************************************************/
#define  PWM_NUM         4         // PWM数量定义

// PWM1(TIM1)管脚功能重映射设置: 
#define PWM1_CH1        PA8         // PWM1(TIM1) CH1管脚定义
// JP8: PWM1(PUL1+/PUL1-),DIR1(DIR1+/DIR1-)和ENA1(ENA1-) IO定义
#define PWM1_PUL        PA8        // PWM1脉冲 
#define PWM1_DIR        PJ13        // DIR1脉冲方向控制 
#define PWM1_ENA        PJ14        // ENA1脉冲使能控制 

// PWM2(TIM2)管脚功能重映射设置: 
#define PWM2_CH1        PA15         // PWM2(TIM2) CH1管脚定义
// JP12: PWM2(PUL2+/PUL2-),DIR2(DIR2+/DIR2-)和ENA2(ENA2-) IO定义
#define PWM2_PUL        PA15         // PWM2脉冲 
#define PWM2_DIR        PD3         // DIR2脉冲方向控制 
#define PWM2_ENA        PD4         // ENA2脉冲使能控制 

// PWM3(TIM3)管脚功能重映射设置: 
#define PWM3_CH1        PC6         // PWM3(TIM3) CH1管脚定义
// JP13: PWM3(PUL3+/PUL3-),DIR3(DIR3+/DIR3-)和ENA3(ENA3-) IO定义
#define PWM3_PUL        PC6         //  PWM3脉冲 
#define PWM3_DIR        PC7         //  DIR3脉冲方向控制 
#define PWM3_ENA        PH15         //  ENA3脉冲使能控制 

// PWM4(TIM17)管脚功能重映射设置: 
#define PWM4_CH1        PF7        // PWM4(TIM17) CH1管脚定义
// JP4: PWM4(PUL4+/PUL4-),DIR4(DIR4+/DIR4-)和ENA4(ENA4-) IO定义
#define PWM4_PUL        PF7        // PWM4脉冲 
#define PWM4_DIR        PJ0        // DIR4脉冲方向控制 
#define PWM4_ENA        PJ1        // ENA4脉冲使能控制 

/************************************************************************************/
// FCLK端口定义
// 注意: +VT是端口输出电压: +5V输出: 请短接VT5, 断开VT12; +12V输出: 请断开VT5, 短接VT12; 
/************************************************************************************/
#define  FCLK_NUM       1          // FCLK数量定义

// FCLK1(TIM8)管脚功能重映射设置: 
// JP14: 1脚, +VT; 2,3脚(FA+,FA-: FCLK1_CH1),PF11; 4,5脚(FB+,FB-: FCLK1_CH2), PF12; 6,7脚(FZ+,FZ-: FCLK1_CH3), PF13; 8脚, GND;
#define FCLK1_CH1      PI5         // FCLK1(TIM1) CH1管脚定义
#define FCLK1_CH2      PI6         // FCLK1(TIM1) CH2管脚定义
#define FCLK1_CH3      PI7         // FCLK1(TIM1) CH3管脚定义

/************************************************************************************/
// I2C管脚定义
/************************************************************************************/
// 板载EEPROM管脚定义(即I2C2引脚定义)
#define I2C2_SCL    PH4    // I2C2 SCL管脚
#define I2C2_SDA    PH5    // I2C2 SDA管脚

/************************************************************************************/
// QSPI管脚定义
/************************************************************************************/
#define QSPI_BK1_CS       PG6   
#define QSPI_BK1_CLK      PF10    
#define QSPI_BK1_IO0      PF8
#define QSPI_BK1_IO1      PF9 
#define QSPI_BK1_IO2      IO_NONE 
#define QSPI_BK1_IO3      IO_NONE 

/************************************************************************************/
// SD卡管脚定义
/************************************************************************************/
// SDMMC管脚定义
#define SDMMC_CMD   PD2
#define SDMMC_CLK   PC12
#define SDMMC_D0    PC8
#define SDMMC_D1    PC9
#define SDMMC_D2    PC10
#define SDMMC_D3    PC11

/************************************************************************************/
// USB管脚定义
/************************************************************************************/
// USB控制IO
#define USB_PWR     PB12
#define USB_DM      PB14
#define USB_DP      PB15
#define USB_VBUS    PB13

/************************************************************************************/
// 网络管脚定义
/************************************************************************************/
// 网络配置引脚
#define ETH_MDC         PC1     // 推挽复用输出，高速(50MHz) 
#define ETH_REF         PA1		// 浮空输入(复位状态) 
#define ETH_MDIO        PA2     // 推挽复用输出，高速(50MHz) 
#define ETH_CRS_DV      PA7     // 浮空输入(复位状态) 
#define ETH_RXD0        PC4		// 浮空输入(复位状态) 
#define ETH_RXD1        PC5		// 浮空输入(复位状态)

#define ETH_TX_EN       PG11    // 推挽复用输出，高速(50MHz)
#define ETH_TXD0        PG13	// 推挽复用输出，高速(50MHz)  
#define ETH_TXD1        PG12	// 推挽复用输出，高速(50MHz) 

#define ETH_MCO         IO_NONE  

#define ETH_RESET       PI10   	// 推挽输出，复位引脚  Modify EmbedARM: 2016.4.28

/************************************************************************************/
// LCD管脚定义
/************************************************************************************/
// 控制信号
#define LCD_CLK        PI14     
#define LCD_HSYNC      PI12
#define LCD_VSYNC      PI13 
#define LCD_DE         PK7 

// RED
#define LCD_R0         IO_NONE  // PI15   
#define LCD_R1         IO_NONE  // PJ0 
#define LCD_R2         IO_NONE  // PJ1 
#define LCD_R3         PJ2 
#define LCD_R4         PJ3 
#define LCD_R5         PJ4 
#define LCD_R6         PJ5 
#define LCD_R7         PJ6 

// GREEN
#define LCD_G0         IO_NONE  // PJ7     
#define LCD_G1         IO_NONE  // PJ8
#define LCD_G2         PI15     // PJ9
#define LCD_G3         PJ10 
#define LCD_G4         PJ11 
#define LCD_G5         PK0 
#define LCD_G6         PK1 
#define LCD_G7         PK2 

// BLUE
#define LCD_B0         IO_NONE  // PJ12     
#define LCD_B1         IO_NONE  // PJ13
#define LCD_B2         IO_NONE  // PJ14
#define LCD_B3         PJ15 
#define LCD_B4         PK3 
#define LCD_B5         PK4 
#define LCD_B6         PK5 
#define LCD_B7         PK6 

#define LCD_RESET      IO_NONE
#define LCD_BL         PF6

#endif
/***********************************************************************************/
// 文件结束
/***********************************************************************************/
